wiklundadam/Swedish_Guy_StartupTest/startup_stm32l476xx.c
#include "stdint.h"
#include "stdio.h"
#include "system_stm32l4xx.h"
#include "stm32l476xx.h"

// These constants are memory addresses defined by ST in linker scripts. Here we import 
// them as externally defined constants.
extern uint32_t	_sidata; // Start of init data
extern uint32_t	_sdata; // Start of data
extern uint32_t	_edata; // End of data
extern uint32_t	_sbss; // Start of BSS segment
extern uint32_t	_ebss; // End of BSS segment

extern uint32_t _estack; // End of RAM memory and top of stack.

// Static constructor initializator from libc
extern void __libc_init_array();

// Main program entry point
extern int main();

// Real entry point of application. Everything that happens before we 
// continue to the main function
void Reset_Handler(){

	// Initialize data segment
	uint32_t *dataInit = &_sdata;
	uint32_t *data = &_sdata;
	while(data < &_edata){
		*data++ = *dataInit++;
	}

	// Initialize BSS segment to zero
	uint32_t *bss = &_sbss;
	while(bss < &_ebss){
		*bss++ = 0;
	}

	// Run the system init from system board support package
	SystemInit();
	
	// Initialize all the static C++ objects and run their constructors
	__libc_init_array();
	
	// Enter main program
	main();

	// Catch return from main with endless look.
	while(1);
}

// This is where we direct unimplemented interupts
void Default_Handler(void){
	while(1);
}

// ALready defined in system_stm32l4xx.h
// // Where the processor will jump in case of hard fault
// void HardFault_Handler(void){
// 	while(1);
// }

// Weakly defined version in this file
__attribute__((weak)) void	NMI_Handler (void)					{Default_Handler();}
__attribute__((weak)) void	HardFault_Handler(void)				{Default_Handler();}
__attribute__((weak)) void	MemManage_Handler(void)				{Default_Handler();}
__attribute__((weak)) void	BusFault_Handler(void)				{Default_Handler();}
__attribute__((weak)) void	UsageFault_Handler(void)			{Default_Handler();}
__attribute__((weak)) void	SVC_Handler(void)					{Default_Handler();}
__attribute__((weak)) void	DebugMon_Handler(void)				{Default_Handler();}
__attribute__((weak)) void	PendSV_Handler(void)				{Default_Handler();}
__attribute__((weak)) void	SysTick_Handler(void)				{Default_Handler();}
__attribute__((weak)) void	WWDG_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	PVD_PVM_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	TAMP_STAMP_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	RTC_WKUP_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	FLASH_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	RCC_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	EXTI0_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	EXTI1_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	EXTI2_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	EXTI3_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	EXTI4_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	DMA1_Channel1_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA1_Channel2_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA1_Channel3_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA1_Channel4_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA1_Channel5_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA1_Channel6_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA1_Channel7_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	ADC1_2_IRQHandler	(void)			{Default_Handler();}
__attribute__((weak)) void	CAN1_TX_IRQHandler	(void)			{Default_Handler();}
__attribute__((weak)) void	CAN1_RX0_IRQHandler	(void)			{Default_Handler();}
__attribute__((weak)) void	CAN1_RX1_IRQHandler	(void)			{Default_Handler();}
__attribute__((weak)) void	CAN1_SCE_IRQHandler	(void)			{Default_Handler();}
__attribute__((weak)) void	EXTI9_5_IRQHandler	(void)			{Default_Handler();}
__attribute__((weak)) void	TIM1_BRK_TIM15_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	TIM1_UP_TIM16_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	TIM1_TRG_COM_TIM17_IRQHandler(void)	{Default_Handler();}
__attribute__((weak)) void	TIM1_CC_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	TIM2_IRQHandler	(void)				{Default_Handler();}
__attribute__((weak)) void	TIM3_IRQHandler	(void)				{Default_Handler();}
__attribute__((weak)) void	TIM4_IRQHandler	(void)				{Default_Handler();}
__attribute__((weak)) void	I2C1_EV_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	I2C1_ER_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	I2C2_EV_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	I2C2_ER_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	SPI1_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	SPI2_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	USART1_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	USART2_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	USART3_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	EXTI15_10_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	RTC_Alarm_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	DFSDM1_FLT3_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	TIM8_BRK_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	TIM8_UP_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	TIM8_TRG_COM_IRQHandler(void) 		{Default_Handler();}
__attribute__((weak)) void	TIM8_CC_IRQHandler(void)			{Default_Handler();}	
__attribute__((weak)) void	ADC3_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	FMC_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	SDMMC1_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	TIM5_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	SPI3_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	UART4_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	UART5_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	TIM6_DAC_IRQHandler(void)			{Default_Handler();}
__attribute__((weak)) void	TIM7_IRQHandler(void)				{Default_Handler();}
__attribute__((weak)) void	DMA2_Channel1_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA2_Channel2_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA2_Channel3_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA2_Channel4_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DMA2_Channel5_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	DFSDM1_FLT0_IRQHandler	(void)		{Default_Handler();}
__attribute__((weak)) void	DFSDM1_FLT1_IRQHandler	(void)		{Default_Handler();}
__attribute__((weak)) void	DFSDM1_FLT2_IRQHandler	(void)		{Default_Handler();}
__attribute__((weak)) void	COMP_IRQHandler 		(void)		{Default_Handler();}
__attribute__((weak)) void	LPTIM1_IRQHandler		(void)		{Default_Handler();}
__attribute__((weak)) void	LPTIM2_IRQHandler		(void)		{Default_Handler();}
__attribute__((weak)) void	OTG_FS_IRQHandler		(void)		{Default_Handler();}
__attribute__((weak)) void	DMA2_Channel6_IRQHandler(void) 		{Default_Handler();}
__attribute__((weak)) void	DMA2_Channel7_IRQHandler(void)		{Default_Handler();}
__attribute__((weak)) void	LPUART1_IRQHandler		(void)		{Default_Handler();}
__attribute__((weak)) void	QUADSPI_IRQHandler		(void)		{Default_Handler();}
__attribute__((weak)) void	I2C3_EV_IRQHandler		(void)		{Default_Handler();}
__attribute__((weak)) void	I2C3_ER_IRQHandler		(void)		{Default_Handler();}
__attribute__((weak)) void	SAI1_IRQHandler			(void)		{Default_Handler();}
__attribute__((weak)) void	SAI2_IRQHandler			(void)		{Default_Handler();}
__attribute__((weak)) void	SWPMI1_IRQHandler		(void)		{Default_Handler();}
__attribute__((weak)) void	TSC_IRQHandler			(void)		{Default_Handler();}
__attribute__((weak)) void	LCD_IRQHandler			(void)		{Default_Handler();}
__attribute__((weak)) void	RNG_IRQHandler			(void)		{Default_Handler();}
__attribute__((weak)) void	FPU_IRQHandler			(void)		{Default_Handler();}


// Interupt vector table is a vector of function pointers, 
// which tells the processor where to jump i case of a hardware interupt 
// Weakly defined until we define our own version of them.
__attribute__((section(".isr_vector")))
const void (*VectorTable[])(void) = {
	(const void (*)(void)) &_estack,
	Reset_Handler,
	NMI_Handler,
	HardFault_Handler,
	MemManage_Handler,
	BusFault_Handler,
	UsageFault_Handler,
	0,
	0,
	0,
	0,
	SVC_Handler,
	DebugMon_Handler,
	0,
	PendSV_Handler,
	SysTick_Handler,
	WWDG_IRQHandler,
	PVD_PVM_IRQHandler,
	TAMP_STAMP_IRQHandler,
	RTC_WKUP_IRQHandler,
	FLASH_IRQHandler,
	RCC_IRQHandler,
	EXTI0_IRQHandler,
	EXTI1_IRQHandler,
	EXTI2_IRQHandler,
	EXTI3_IRQHandler,
	EXTI4_IRQHandler,
	DMA1_Channel1_IRQHandler,
	DMA1_Channel2_IRQHandler,
	DMA1_Channel3_IRQHandler,
	DMA1_Channel4_IRQHandler,
	DMA1_Channel5_IRQHandler,
	DMA1_Channel6_IRQHandler,
	DMA1_Channel7_IRQHandler,
	ADC1_2_IRQHandler,
	CAN1_TX_IRQHandler,
	CAN1_RX0_IRQHandler,
	CAN1_RX1_IRQHandler,
	CAN1_SCE_IRQHandler,
	EXTI9_5_IRQHandler,
	TIM1_BRK_TIM15_IRQHandler,
	TIM1_UP_TIM16_IRQHandler,
	TIM1_TRG_COM_TIM17_IRQHandler,
	TIM1_CC_IRQHandler,
	TIM2_IRQHandler,
	TIM3_IRQHandler,
	TIM4_IRQHandler,
	I2C1_EV_IRQHandler,
	I2C1_ER_IRQHandler,
	I2C2_EV_IRQHandler,
	I2C2_ER_IRQHandler,
	SPI1_IRQHandler,
	SPI2_IRQHandler,
	USART1_IRQHandler,
	USART2_IRQHandler,
	USART3_IRQHandler,
	EXTI15_10_IRQHandler,
	RTC_Alarm_IRQHandler,
	DFSDM1_FLT3_IRQHandler,
	TIM8_BRK_IRQHandler,
	TIM8_UP_IRQHandler,
	TIM8_TRG_COM_IRQHandler,
	TIM8_CC_IRQHandler,
	ADC3_IRQHandler,
	FMC_IRQHandler,
	SDMMC1_IRQHandler,
	TIM5_IRQHandler,
	SPI3_IRQHandler,
	UART4_IRQHandler,
	UART5_IRQHandler,
	TIM6_DAC_IRQHandler,
	TIM7_IRQHandler,
	DMA2_Channel1_IRQHandler,
	DMA2_Channel2_IRQHandler,
	DMA2_Channel3_IRQHandler,
	DMA2_Channel4_IRQHandler,
	DMA2_Channel5_IRQHandler,
	DFSDM1_FLT0_IRQHandler,
	DFSDM1_FLT1_IRQHandler,
	DFSDM1_FLT2_IRQHandler,
	COMP_IRQHandler,
	LPTIM1_IRQHandler,
	LPTIM2_IRQHandler,
	OTG_FS_IRQHandler,
	DMA2_Channel6_IRQHandler,
	DMA2_Channel7_IRQHandler,
	LPUART1_IRQHandler,
	QUADSPI_IRQHandler,
	I2C3_EV_IRQHandler,
	I2C3_ER_IRQHandler,
	SAI1_IRQHandler,
	SAI2_IRQHandler,
	SWPMI1_IRQHandler,
	TSC_IRQHandler,
	LCD_IRQHandler,
	0,
	RNG_IRQHandler,
	FPU_IRQHandler
};